#Reading the Dataset

In [169]:
import pandas as pd
import numpy as np
DataSet = pd.read_csv("summer.csv")

#### 1. In how many cities Summer Olympics is held so far?

In [170]:
cities = DataSet['City'].unique()

print("The Number of cities in which Summer Olympics are held is:", len(cities))

The Number of cities in which Summer Olympics are held is: 22

### 2. Which sport is having most number of Gold Medals so far? (Top 5)

In [171]:
gold_medals = []
gold = DataSet[DataSet['Medal'] == "Gold"]
for sport in DataSet['Sport'].unique():
    gold_medals.append([sport, len(gold[gold['Sport'] == sport])])

#Converting the gold_medals list to DataFrame

display = pd.DataFrame(gold_medals, columns = ['Sports', 'Gold Medals'])
display.sort_values(by = "Gold Medals", ascending=False).head()

        Sports  Gold Medals
0     Aquatics         1421
1    Athletics         1215
17      Rowing          890
4   Gymnastics          820
3      Fencing          552

### 3. Which sport is having most number of medals so far? (Top 5)

In [172]:
medals = []
for sport in DataSet['Sport'].unique():
    medals.append([sport, len(DataSet[DataSet['Sport'] == sport])])

#Converting the Medals list to DataFrame

display = pd.DataFrame(medals, columns = ['Sports','Medals'])
display.sort_values(by = "Medals", ascending=False).head()

        Sports  Medals
0     Aquatics    4170
1    Athletics    3638
17      Rowing    2667
4   Gymnastics    2307
3      Fencing    1613

### 4. Which player has won most number of medals? (Top 5)

In [173]:
player_medals = []
names = DataSet['Athlete'].unique()
for player in names:
    player_medals.append([player, len(DataSet[DataSet['Athlete'] == player])])

# Converting the player and their medals to DataFrame

display = pd.DataFrame(player_medals, columns=["PLayer", "No of Medals"])
display.sort_values(by = "No of Medals", ascending=False).head()

                     PLayer  No of Medals
18640       PHELPS, Michael            22
7197       LATYNINA, Larisa            18
9948     ANDRIANOV, Nikolay            15
6591           ONO, Takashi            13
5103   MANGIAROTTI, Edoardo            13

### 5. Which player has won most number Gold Medals of medals? (Top 5)

In [174]:
gold_players = []
goldenplayer = DataSet[DataSet['Medal'] == "Gold"]
for player in DataSet['Athlete'].unique():
    gold_players.append([player, len(goldenplayer[goldenplayer['Athlete'] == player])])

# Converting the player and their medals to DataFrame

display = pd.DataFrame(gold_players,columns=["Player", "No of Gold Medals"])
display.sort_values(by="No of Gold Medals", ascending=False).head()

                 Player  No of Gold Medals
18640   PHELPS, Michael                 18
12468       LEWIS, Carl                  9
8811        SPITZ, Mark                  9
2262       NURMI, Paavo                  9
7197   LATYNINA, Larisa                  9

### 6. In which year India won first Gold Medal in Summer Olympics?

In [205]:
# India_gold
gold = DataSet[DataSet['Medal'] == "Gold"]
India_Gold = gold[gold['Country'] == "IND"]
print("India won the first Gold Medal in Summer Olympics in the year:", list(India_Gold['Year'])[0])

India won the first Gold Medal in Summer Olympics in the year: 1928